Student(
  (input_stream): ModuleList(
    (0-3): 4 x InputStream(
      (init_bn): BatchNorm2d(4, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (stem_scn): Spatial_Graph_Layer(
        (conv): SpatialGraphConv(
          (gcn): Conv2d(4, 96, kernel_size=(1, 1), stride=(1, 1))
        )
        (bn): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (residual): Sequential(
          (0): Conv2d(4, 48, kernel_size=(1, 1), stride=(1, 1))
          (1): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (activation): Swish_Spatial_Graph_Layer
      )
      (stem_tcn): Temporal_Basic_Layer(
        (conv): Conv2d(48, 48, kernel_size=(3, 1), stride=(1, 1), padding=(1, 0))
        (bn): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (residual): Identity()
        (activation): Swish_Temporal_Basic_Layer
      )
      (block-0_scn): Spatial_Graph_Layer(
        (conv): SpatialGraphConv(
          (gcn): Conv2d(48, 96, kernel_size=(1, 1), stride=(1, 1))
        )
        (bn): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (residual): Identity()
        (activation): Swish_Spatial_Graph_Layer
      )
      (block-0_tcn-0): Temporal_Sep_Layer(
        (expand_conv): Sequential(
          (0): Conv2d(48, 72, kernel_size=(1, 1), stride=(1, 1))
          (1): BatchNorm2d(72, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (depth_conv): Sequential(
          (0): Conv2d(72, 72, kernel_size=(3, 1), stride=(3, 1), padding=(1, 0), groups=72)
          (1): BatchNorm2d(72, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (point_conv): Sequential(
          (0): Conv2d(72, 48, kernel_size=(1, 1), stride=(1, 1))
          (1): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (activation): Swish_Temporal_Sep_Layer
        (residual): Sequential(
          (0): Conv2d(48, 48, kernel_size=(1, 1), stride=(3, 1))
          (1): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
      (block-0_tcn-1): Temporal_Sep_Layer(
        (expand_conv): Sequential(
          (0): Conv2d(48, 72, kernel_size=(1, 1), stride=(1, 1))
          (1): BatchNorm2d(72, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (depth_conv): Sequential(
          (0): Conv2d(72, 72, kernel_size=(3, 1), stride=(1, 1), padding=(1, 0), groups=72)
          (1): BatchNorm2d(72, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (point_conv): Sequential(
          (0): Conv2d(72, 48, kernel_size=(1, 1), stride=(1, 1))
          (1): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (activation): Swish_Temporal_Sep_Layer
        (residual): Identity()
      )
      (block-0_att): AttentionLayer(
        (att): JointAtt(
          (fcn): Sequential(
            (0): AdaptiveAvgPool2d(output_size=1)
            (1): Conv2d(29, 14, kernel_size=(1, 1), stride=(1, 1))
            (2): BatchNorm2d(14, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (3): ReLU()
            (4): Conv2d(14, 29, kernel_size=(1, 1), stride=(1, 1))
            (5): Softmax(dim=1)
          )
        )
        (bn): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (activation): Swish_AttentionLayer
      )
      (block-1_scn): Spatial_Graph_Layer(
        (conv): SpatialGraphConv(
          (gcn): Conv2d(48, 96, kernel_size=(1, 1), stride=(1, 1))
        )
        (bn): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (residual): Identity()
        (activation): Swish_Spatial_Graph_Layer
      )
      (block-1_tcn-0): Temporal_Sep_Layer(
        (expand_conv): Sequential(
          (0): Conv2d(48, 72, kernel_size=(1, 1), stride=(1, 1))
          (1): BatchNorm2d(72, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (depth_conv): Sequential(
          (0): Conv2d(72, 72, kernel_size=(3, 1), stride=(3, 1), padding=(1, 0), groups=72)
          (1): BatchNorm2d(72, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (point_conv): Sequential(
          (0): Conv2d(72, 48, kernel_size=(1, 1), stride=(1, 1))
          (1): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (activation): Swish_Temporal_Sep_Layer
        (residual): Sequential(
          (0): Conv2d(48, 48, kernel_size=(1, 1), stride=(3, 1))
          (1): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
      (block-1_tcn-1): Temporal_Sep_Layer(
        (expand_conv): Sequential(
          (0): Conv2d(48, 72, kernel_size=(1, 1), stride=(1, 1))
          (1): BatchNorm2d(72, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (depth_conv): Sequential(
          (0): Conv2d(72, 72, kernel_size=(3, 1), stride=(1, 1), padding=(1, 0), groups=72)
          (1): BatchNorm2d(72, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (point_conv): Sequential(
          (0): Conv2d(72, 48, kernel_size=(1, 1), stride=(1, 1))
          (1): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (activation): Swish_Temporal_Sep_Layer
        (residual): Identity()
      )
      (block-1_att): AttentionLayer(
        (att): JointAtt(
          (fcn): Sequential(
            (0): AdaptiveAvgPool2d(output_size=1)
            (1): Conv2d(29, 14, kernel_size=(1, 1), stride=(1, 1))
            (2): BatchNorm2d(14, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
            (3): ReLU()
            (4): Conv2d(14, 29, kernel_size=(1, 1), stride=(1, 1))
            (5): Softmax(dim=1)
          )
        )
        (bn): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        (activation): Swish_AttentionLayer
      )
    )
  )
  (main_stream): MainStream(
    (block-0_scn_main): Spatial_Graph_Layer(
      (conv): SpatialGraphConv(
        (gcn): Conv2d(192, 256, kernel_size=(1, 1), stride=(1, 1))
      )
      (bn): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (residual): Sequential(
        (0): Conv2d(192, 128, kernel_size=(1, 1), stride=(1, 1))
        (1): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
      (activation): Swish_Spatial_Graph_Layer
    )
    (block-0_tcn_main): Temporal_Basic_Layer(
      (conv): Conv2d(128, 128, kernel_size=(7, 1), stride=(1, 1), padding=(3, 0))
      (bn): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (residual): Identity()
      (activation): Swish_Temporal_Basic_Layer
    )
    (block-0_att_main): AttentionLayer(
      (att): JointAtt(
        (fcn): Sequential(
          (0): AdaptiveAvgPool2d(output_size=1)
          (1): Conv2d(29, 14, kernel_size=(1, 1), stride=(1, 1))
          (2): BatchNorm2d(14, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (3): ReLU()
          (4): Conv2d(14, 29, kernel_size=(1, 1), stride=(1, 1))
          (5): Softmax(dim=1)
        )
      )
      (bn): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (activation): Swish_AttentionLayer
    )
    (block-1_scn_main): Spatial_Graph_Layer(
      (conv): SpatialGraphConv(
        (gcn): Conv2d(128, 96, kernel_size=(1, 1), stride=(1, 1))
      )
      (bn): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (residual): Sequential(
        (0): Conv2d(128, 48, kernel_size=(1, 1), stride=(1, 1))
        (1): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      )
      (activation): Swish_Spatial_Graph_Layer
    )
    (block-1_tcn_main): Temporal_Basic_Layer(
      (conv): Conv2d(48, 48, kernel_size=(7, 1), stride=(1, 1), padding=(3, 0))
      (bn): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (residual): Identity()
      (activation): Swish_Temporal_Basic_Layer
    )
    (block-1_att_main): AttentionLayer(
      (att): JointAtt(
        (fcn): Sequential(
          (0): AdaptiveAvgPool2d(output_size=1)
          (1): Conv2d(29, 14, kernel_size=(1, 1), stride=(1, 1))
          (2): BatchNorm2d(14, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          (3): ReLU()
          (4): Conv2d(14, 29, kernel_size=(1, 1), stride=(1, 1))
          (5): Softmax(dim=1)
        )
      )
      (bn): BatchNorm2d(48, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (activation): Swish_AttentionLayer
    )
  )
  (classifier): Classifier(
    (gap): AdaptiveAvgPool3d(output_size=1)
    (dropout): Dropout(p=0, inplace=False)
    (fc): Conv3d(48, 2, kernel_size=(1, 1, 1), stride=(1, 1, 1))
  )
)
